//---------------------------------------------------------------------------------------------------------------------------
//--Структурки/Енумы и прочее
//---------------------------------------------------------------------------------------------------------------------------
enum
	{
	RESPOUNCE_KEY1 = 49u,			//Ключ зашифровки авторизации 1
	RESPOUNCE_KEY2 = 67u,			//Ключ зашифровки авторизации 2
	
	THREAD_SECOND = 20u,			//Через сколько секунд очищать вектора
	OOG_PLAYER_MAX_LIMIT = 3000u,	//Максимальное количество игроков в ООГ векторе
	OOG_MAX_LIMIT = 9500u,			//Максимальный лимит ООГ пакетов
	OOG_TIMER_LIMIT = 250u,			//Уменьшение ООГ лимита по таймеру
	OOG_LOW_LIMIT = 2u,				//Сколько добавлять в лимит за легкий пакет
	OOG_HORMAL_LIMIT = 10u,			//Сколько добавлять в лимит за средний пакет
	OOG_HIGHT_LIMIT = 40u,			//Сколько добавлять в лимит за тяжелый пакет
	OOG_HIGHT_COUNT = 21u,			//Количество тяжелых пакетов
	L7_MAX_CONNECT = 1000u,			//Максимальное количество коннектов
	L7_MAX_IP = 200,				//Максимальное количество одновременных соединений
	L7_LIMIT = 5,					//Максимальное количество запросов на авторизацию
	TWMAN_DELAY = 2400,
	TWMAN_DAY = 86400,
	};
//---------------------------------------------------------------------------------------------------------------------------
//Структурки ООГ 
//---------------------------------------------------------------------------------------------------------------------------
struct OOG_LIMIT
{
	unsigned int sid;
	unsigned int load_state;
	OOG_LIMIT(unsigned int sid, unsigned int load_state)
		{
		this->sid = sid;
		this->load_state = load_state;
		}
};
//---------------------------------------------------------------------------------------------------------------------------
//Структурки L7 
//---------------------------------------------------------------------------------------------------------------------------
struct L7
{
	unsigned int ip;
	unsigned int count;
	L7(unsigned int ip, unsigned int count)
	{
		this->ip = ip;
		this->count = count;
	}
};
//---------------------------------------------------------------------------------------------------------------------------
//Структурки ТВ
//---------------------------------------------------------------------------------------------------------------------------
#define TWMAN_INCDAY(time) ((time + 345600) % 604800) / 86400
struct  TWMAN_MATRIX
{
	bool enable;
	time_t begin;
	time_t end;
	time_t max;
	time_t battle;
	time_t len;
};
struct  TWMAN
{
	int day;
	int reward;
	int interval;
	TWMAN_MATRIX matrix[7];
};
//---------------------------------------------------------------------------------------------------------------------------


